Revit 2024 API
MacroModuleIterator Class
 An iterator to the Macros in a MacroModule.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class MacroModuleIterator : IEnumerator<Macro>
Visual Basic
Public Class MacroModuleIterator _
	Implements IEnumerator(Of Macro)
Visual C++
public ref class MacroModuleIterator : IEnumerator<Macro^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.MacroModuleIterator
See Also
MacroModuleIterator Members
Autodesk.Revit.DB.Macros Namespace